[graphicalobject]
Name=LMethod
x=144;10
y=4
width=602
height=42
Help= ;
rc-dll=hpleo008.dll
PosStyle=floatable
Activate=0
Z-Order=1

[ToolDescriptor]
1=Method,statuslist,hpgwct02.dll
2=MethodInfo,static,hpgwct02.dll
;2=MethodInfo,statuslist,hpgwct02.dll
;3=SimpleMethod,radiobutton,hpgbut02.dll
;4=FullMethod,radiobutton,hpgbut02.dll
;5=LockMethodEditing,stickybutton,hpgbut02.dll
;6=


[fontalias]
1=normal|ＭＳ Ｐゴシック,9,normal
2=bold|ＭＳ Ｐゴシック,9,bold
3=


[coloralias]
1=



[static MethodInfo]
x=62;85
y=1
width=480
height=40
Help=メソッド情報表示。クリックで設定。
Text1=メソッド コメント フィールド: ここに表示します。
Text=
Font=normal
FrameThickness=1
Dimage=4
Command=@view.floatingmenu "menu[1]", "MethodInfo"
Cursor=Hand
RcDll=hpleo008.dll


[statuslist Method]
x=0
y=0
width=62;80
height=42
Help=クリックでメソッド パラメータにアクセスできます。
Cursor=Hand
Command=@view.floatingmenu "menu[1]", "Method"
Font=bold
BKColor=GRAY
RcDll=hpleo008.dll
RcDll1=hpleo008.dll
;Elements=mthReady|MthModifiedBKNOP|MthModifiedNOP
Symbols1=MthGreen|MthBlue|MthRed|MthYellow|MthMagenta|MthCyan|MthWhite|
Elements=1|1|SysGreen|SystemReady|MthGreen| |
;Command=@view.floatingmenu "menu[1]", "SeqCurrentVial"
ImageStart=1
ElementStart=5
ElementEnd=5
;Symbols1=MthOff|MthNrdy|MthReady|MthRun|MthWillRun|MthError|MthModifiedBKYES|MthModifiedYES|MthModifiedBKNOP|MthModifiedNOP
;ElementStart=1
;ElementEnd=1
;ImageStart=1
;MthOff=RBMP.MethodSym_Off
MthWhite=RBMP.MethodSym_Off
MthYellow=RBMP.MethodSym_Nrdy
MthGreen=RBMP.MethodSym_Ready
MthBlue=RBMP.MethodSym_Run
;MthWillRun=RBMP.MethodSym_WillRun
MthRed=RBMP.MethodSym_Error
MthMagenta=RBMP.MethodSym_WAITING
MthCyan=RBMP.MethodSym_LoadSave
MthModifiedBKYES=RBMP.METHEDIT_CHANGEDNEG
MthModifiedYES=RBMP.METHEDIT_CHANGED
MthModifiedBKNOP=RBMP.SRCAND_NOP
MthModifiedNOP=RBMP.SRCPAINT_NOP
Image1=Background
x1=0
y1=0
ROP1=SRCCOPY
;Image2=ChangedNegative
x2=0
y2=0
ROP2=SRCAND
Image3=Changed
x3=0
y3=0
ROP3=SRCPAINT
Image4=Method:
x4=35
y4=15
;Image5=ISOCRATIC.M
x5=91
y5=15



[radiobutton SimpleMethod]
x=566
y=1
width=23
height=23
Help=シンプル メソッド選択
ImageList=S|S|S
Command=SimpleMethMenus
Group=1
State=1

[radiobutton FullMethod]
x=587
y=1
width=23
height=23
Help=フル メソッド選択
ImageList=F|F|F
Command=FullMethMenus
Group=1
State=0

[stickybutton LockMethodEditing]
x=630
y=1
width=23
height=23
Help=メソッド設定ロック、アンロック
ImageList=RBMP.METHEDIT_UNLOCKED|RBMP.METHEDIT_LOCKED
State=0
CmdList=LockMethMenus|UnlockMethMenus


[statuslist MethodInfo]
x=198
y=1
width=320
height=50
Help=メソッド情報テキストがここにきます。
Text1=メソッド コメント フィールド: ここに表示します。
Text=
Font=normal
Image1=Method Comment field: show it here
x1=0
y1=10
Image2=Method Comment field: line 2
x2=0
y2=23
Font=normal
BKColor=GRAY

